In [4]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

# Concatenae

In [4]:
arr1 = np.arange(9).reshape(3,3)
arr1

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [5]:
arr2=arr1.copy()

In [11]:
np.concatenate([arr1,arr2])

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8],
       [0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [14]:
np.concatenate([arr1,arr2],axis=1)

array([[0, 1, 2, 0, 1, 2],
       [3, 4, 5, 3, 4, 5],
       [6, 7, 8, 6, 7, 8]])

In [18]:
s1 = Series([1,2,3],index=['x','y','z'])
s1

x    1
y    2
z    3
dtype: int64

In [19]:
s2 = Series([4,5],index=['A','B'])
s2

A    4
B    5
dtype: int64

In [24]:
pd.concat([s1, s2])

x    1
y    2
z    3
A    4
B    5
dtype: int64

In [26]:
pd.concat([s1, s2],axis=1)

d:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0    1
A  NaN  4.0
B  NaN  5.0
x  1.0  NaN
y  2.0  NaN
z  3.0  NaN

In [28]:
df1 = DataFrame(np.random.rand(4,3),columns=['x','y','z'])
df1

          x         y         z
0  0.874236  0.954042  0.144319
1  0.506843  0.445913  0.916116
2  0.692352  0.171259  0.654453
3  0.335290  0.513131  0.889685

In [29]:
df2 = DataFrame(np.random.rand(3,3),columns=['x','y','A'])
df2

          x         y         A
0  0.601011  0.904736  0.579060
1  0.098738  0.154208  0.451000
2  0.616801  0.413720  0.255707

In [33]:
pd.concat([df1,df2])

d:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          A         x         y         z
0       NaN  0.874236  0.954042  0.144319
1       NaN  0.506843  0.445913  0.916116
2       NaN  0.692352  0.171259  0.654453
3       NaN  0.335290  0.513131  0.889685
0  0.579060  0.601011  0.904736       NaN
1  0.451000  0.098738  0.154208       NaN
2  0.255707  0.616801  0.413720       NaN

In [34]:
pd.concat([df1,df2],axis=1)

          x         y         z         x         y         A
0  0.874236  0.954042  0.144319  0.601011  0.904736  0.579060
1  0.506843  0.445913  0.916116  0.098738  0.154208  0.451000
2  0.692352  0.171259  0.654453  0.616801  0.413720  0.255707
3  0.335290  0.513131  0.889685       NaN       NaN       NaN

# Combine

In [37]:
s1 = Series([2, np.nan, 4, np.nan], index=['A','B','C','D'])
s1

A    2.0
B    NaN
C    4.0
D    NaN
dtype: float64

In [38]:
s2 = Series([1,2,3,4], index=['A','B','C','D'])
s2

A    1
B    2
C    3
D    4
dtype: int64

In [45]:
s1.combine_first(s2)

A    2.0
B    2.0
C    4.0
D    4.0
dtype: float64

In [7]:
df1 = DataFrame({'X':[1, np.nan, 3, np.nan],
                'Y':[5, np.nan, 7, np.nan],
                'Z':[9, np.nan, 11, np.nan]})
df1

     X    Y     Z
0  1.0  5.0   9.0
1  NaN  NaN   NaN
2  3.0  7.0  11.0
3  NaN  NaN   NaN

In [9]:
df2 = DataFrame({'Z':[np.nan,10, np.nan,12],
                'A':[1,2,3,4]})
df2

      Z  A
0   NaN  1
1  10.0  2
2   NaN  3
3  12.0  4

In [10]:
df1.combine_first(df2)

     A    X    Y     Z
0  1.0  1.0  5.0   9.0
1  2.0  NaN  NaN  10.0
2  3.0  3.0  7.0  11.0
3  4.0  NaN  NaN  12.0